# Importing Necessary Packages and Connecting to Database

In [1]:
# Needed for SQL Alchemy  
from sqlalchemy import create_engine
engine=create_engine('sqlite:///CourseData',echo=False)

# Needed for %sql Magic
%load_ext sql

import sqlite3

# Initialize 
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

## Domain Integrity Checks

In [2]:
%%sql
SELECT count(catalog_id)
FROM CRN;

 * sqlite:///CourseData.db
Done.

[(13860,)]

In [3]:
%%sql
SELECT DISTINCT count(catalog_id)
FROM CRN;

 * sqlite:///CourseData.db
Done.

[(13860,)]

In [4]:
%%sql 
SELECT count(StartTime)
FROM COURSE;

 * sqlite:///CourseData.db
Done.

[(17,)]

In [5]:
%%sql
SELECT count(EndTime)
FROM COURSE;

 * sqlite:///CourseData.db
Done.

[(17,)]

## Entity Integrity Constraints

In [6]:
%%sql
SELECT sum(crn_term) IS NULL as 'CRN_Term Null Values'
FROM CRN;

 * sqlite:///CourseData.db
Done.

[(0,)]

In [7]:
%%sql
SELECT count(crn_term) as 'Number of crn_term'
FROM CRN;

 * sqlite:///CourseData.db
Done.

[(13860,)]

In [8]:
%%sql
SELECT DISTINCT count(crn_term) as 'Number of crn_term'
FROM CRN;

 * sqlite:///CourseData.db
Done.

[(13860,)]

In [9]:
%%sql
SELECT sum(Term) IS NULL as 'Term Null Values'
FROM terms;

 * sqlite:///CourseData.db
Done.

[(0,)]

In [10]:
%%sql
SELECT count(term) as 'Number of Terms'
FROM terms;

 * sqlite:///CourseData.db
Done.

[(16,)]

In [11]:
%%sql
SELECT DISTINCT count(term) as 'Number of Terms'
FROM Terms;

 * sqlite:///CourseData.db
Done.

[(16,)]

In [12]:
%%sql
Select sum(CalendarDate) IS NUll as 'CalendarDate Null Values'
FROM Calendar;

 * sqlite:///CourseData.db
Done.

[(0,)]

In [13]:
%%sql
SELECT count(CalendarDate) as 'Number of Dates'
FROM Calendar;

 * sqlite:///CourseData.db
Done.

[(1734,)]

In [14]:
%%sql

Select DISTINCT count(CalendarDate) as 'Number of Dates'
FROM Calendar;

 * sqlite:///CourseData.db
Done.

[(1734,)]

## Referential Integrity Constraints

In [15]:
%%sql
select *
from CRN
join
Course on crn.crn_term=Course.crn_term
limit 5;

 * sqlite:///CourseData.db
Done.

[('71576 Fall2014', '71576', 'Fall2014', 'Health and Wellness Clinical', 'C', 'NS 0301C', '6', '7', '1', 'TBA', '71576 Fall2014', 'Kelly Ann  Sullivan', '08:00:00', '15:00:00'),
 ('71578 Fall2014', '71578', 'Fall2014', 'Health and Wellness Clinical', 'D', 'NS 0301C', '7', '7', '0', 'TBA', '71578 Fall2014', 'Sheila S.  Iacono', '08:00:00', '15:00:00'),
 ('71580 Fall2014', '71580', 'Fall2014', 'Health and Wellness Clinical', 'E', 'NS 0301C', '7', '7', '0', 'TBA', '71580 Fall2014', 'Suzanne T.  Chaplik', '08:00:00', '15:00:00'),
 ('71581 Fall2014', '71581', 'Fall2014', 'Health and Wellness Clinical', 'F', 'NS 0301C', '8', '8', '0', 'TBA', '71581 Fall2014', 'Katherine Marie  Saracino', '08:00:00', '15:00:00'),
 ('71585 Fall2014', '71585', 'Fall2014', 'Health and Wellness Clinical', 'G', 'NS 0301C', '7', '7', '0', 'TBA', '71585 Fall2014', 'Laura A.  Conklin', '08:00:00', '15:00:00')]

In [16]:
%%sql
select CRN.Term, Course.Primary_Instructor
from CRN
JOIN Course ON crn.crn_term=Course.crn_term;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 'Kelly Ann  Sullivan'),
 ('Fall2014', 'Sheila S.  Iacono'),
 ('Fall2014', 'Suzanne T.  Chaplik'),
 ('Fall2014', 'Katherine Marie  Saracino'),
 ('Fall2014', 'Laura A.  Conklin'),
 ('Fall2014', 'Julie Christine  McCullough'),
 ('Fall2014', 'Susan N.  Bartos'),
 ('Fall2014', 'Danielle E.  Hall'),
 ('Fall2014', 'Katherine Marie  Saracino'),
 ('Fall2014', 'Katherine Marie  Saracino'),
 ('Fall2014', 'Leslie A.  Lincoln'),
 ('Fall2014', 'Karen H.  Burrows'),
 ('Fall2014', "Suzanne M.  O'Connor"),
 ('Summer2015', 'Sally O.  Gerard'),
 ('Spring2015', 'Lydia H.  Greiner'),
 ('Spring2015', 'Jessica   Planas'),
 ('Fall2015', 'Sandy Natalie  Cayo')]

## Fun Queries

In [17]:
%%sql

Select avg(rem) AS 'Average Remaining Seats'
FROM course;

 * sqlite:///CourseData.db
Done.

[(0.11764705882352941,)]

In [18]:
%%sql 
SELECT  StartTime, avg(rem) AS 'Average Remaining Seats'
FROM course
WHERE StartTime = '08:00:00';

 * sqlite:///CourseData.db
Done.

[('08:00:00', 0.125)]